[Killed] BlockStatement
lucas/vv-p2-poc/src/main.js:1:47
-function desconto(salario, aliquota, deducao) {
-	return (((salario * aliquota) / 100.00) - deducao);
-};
+function desconto(salario, aliquota, deducao) {};
 
 export function irpf(salario) {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArithmeticOperator
lucas/vv-p2-poc/src/main.js:2:12
 function desconto(salario, aliquota, deducao) {
-	return (((salario * aliquota) / 100.00) - deducao);
+	return (((salario / aliquota) / 100.00) - deducao);
 };
 
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: Infinity

[Killed] ArithmeticOperator
lucas/vv-p2-poc/src/main.js:2:11
 function desconto(salario, aliquota, deducao) {
-	return (((salario * aliquota) / 100.00) - deducao);
+	return ((salario * aliquota * 100.00) - deducao);
 };
 
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80.5
Received: 4352645.2

[Killed] BlockStatement
lucas/vv-p2-poc/src/main.js:5:31
 	return (((salario * aliquota) / 100.00) - deducao);
 };
 
-export function irpf(salario) {
-	if ((salario >= 0) && (salario <= 1903.98)) {
-		return desconto(salario, 0, 0);
-	} else if ((salario >= 1903.99) && (salario <= 2826.65)) {
-		return desconto(salario, 7.5, 142.80);
-	} else if ((salario >= 2826.66) && (salario <= 3751.05)) {
-		return desconto(salario, 15.0, 354.80);
-	} else if ((salario >= 3751.06) && (salario <= 4664.58)) {
-		return desconto(salario, 22.5, 636.13);
-	} else {
-		return desconto(salario, 27.5, 868.36);
-	}
-}
+export function irpf(salario) {}
 
 export default function main() {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
lucas/vv-p2-poc/src/main.js:6:25
 };
 
 export function irpf(salario) {
-	if ((salario >= 0) && (salario <= 1903.98)) {
+	if ((salario >= 0) && (salario > 1903.98)) {
 		return desconto(salario, 0, 0);
 	} else if ((salario >= 1903.99) && (salario <= 2826.65)) {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -620.86

[Killed] ConditionalExpression
lucas/vv-p2-poc/src/main.js:6:25
 };
 
 export function irpf(salario) {
-	if ((salario >= 0) && (salario <= 1903.98)) {
+	if ((salario >= 0) && (true)) {
 		return desconto(salario, 0, 0);
 	} else if ((salario >= 1903.99) && (salario <= 2826.65)) {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80.5
Received: 0

[Killed] ConditionalExpression
lucas/vv-p2-poc/src/main.js:8:38
 export function irpf(salario) {
 	if ((salario >= 0) && (salario <= 1903.98)) {
 		return desconto(salario, 0, 0);
-	} else if ((salario >= 1903.99) && (salario <= 2826.65)) {
+	} else if ((salario >= 1903.99) && (true)) {
 		return desconto(salario, 7.5, 142.80);
 	} else if ((salario >= 2826.66) && (salario <= 3751.05)) {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80.5
Received: 74.85

[Killed] LogicalOperator
lucas/vv-p2-poc/src/main.js:8:13
 export function irpf(salario) {
 	if ((salario >= 0) && (salario <= 1903.98)) {
 		return desconto(salario, 0, 0);
-	} else if ((salario >= 1903.99) && (salario <= 2826.65)) {
+	} else if (salario >= 1903.99 || salario <= 2826.65) {
 		return desconto(salario, 7.5, 142.80);
 	} else if ((salario >= 2826.66) && (salario <= 3751.05)) {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80.5
Received: 74.85

[Killed] EqualityOperator
lucas/vv-p2-poc/src/main.js:10:14
 		return desconto(salario, 0, 0);
 	} else if ((salario >= 1903.99) && (salario <= 2826.65)) {
 		return desconto(salario, 7.5, 142.80);
-	} else if ((salario >= 2826.66) && (salario <= 3751.05)) {
+	} else if ((salario < 2826.66) && (salario <= 3751.05)) {
 		return desconto(salario, 15.0, 354.80);
 	} else if ((salario >= 3751.06) && (salario <= 4664.58)) {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80.5
Received: -70.31000000000006

[Killed] ConditionalExpression
lucas/vv-p2-poc/src/main.js:10:38
 		return desconto(salario, 0, 0);
 	} else if ((salario >= 1903.99) && (salario <= 2826.65)) {
 		return desconto(salario, 7.5, 142.80);
-	} else if ((salario >= 2826.66) && (salario <= 3751.05)) {
+	} else if ((salario >= 2826.66) && (true)) {
 		return desconto(salario, 15.0, 354.80);
 	} else if ((salario >= 3751.06) && (salario <= 4664.58)) {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 479.14
Received: 380.2

[Killed] ConditionalExpression
lucas/vv-p2-poc/src/main.js:12:38
 		return desconto(salario, 7.5, 142.80);
 	} else if ((salario >= 2826.66) && (salario <= 3751.05)) {
 		return desconto(salario, 15.0, 354.80);
-	} else if ((salario >= 3751.06) && (salario <= 4664.58)) {
+	} else if ((salario >= 3751.06) && (true)) {
 		return desconto(salario, 22.5, 636.13);
 	} else {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 479.14
Received: 466.37

[Killed] EqualityOperator
lucas/vv-p2-poc/src/main.js:12:38
 		return desconto(salario, 7.5, 142.80);
 	} else if ((salario >= 2826.66) && (salario <= 3751.05)) {
 		return desconto(salario, 15.0, 354.80);
-	} else if ((salario >= 3751.06) && (salario <= 4664.58)) {
+	} else if ((salario >= 3751.06) && (salario > 4664.58)) {
 		return desconto(salario, 22.5, 636.13);
 	} else {
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 479.14
Received: 466.37

[Killed] BlockStatement
lucas/vv-p2-poc/src/main.js:14:9
 		return desconto(salario, 15.0, 354.80);
 	} else if ((salario >= 3751.06) && (salario <= 4664.58)) {
 		return desconto(salario, 22.5, 636.13);
-	} else {
-		return desconto(salario, 27.5, 868.36);
-	}
+	} else {}
 }
 
killedBy: todos os nos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 479.14
Received: undefined
